# Opdracht groeperen en pivoteren
Om te laten zien dat je data niet eerst moet downloaden: je kunt ook een URL gebruiken met read_csv

In [1]:
import pandas as pd
URL = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
df = pd.read_csv(URL, delimiter='|')
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## Zorg voor een index
Lees de gegevens opnieuw, maar nu met user_id als indexkolom. Bewaar het resultaat in een variabele 'users'

In [2]:
users = pd.read_csv(URL, delimiter='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

## Welke kolommen zijn er en wat zijn de types
Toon kolommen en hun types. Kijk meteen of er NA-waarden zijn

In [3]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

## Toon statistieken
Toon voor alle kolommen (dus ook voor de niet-numerieke) de statistieken

In [4]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

## Voor welke kolommen zou je een categorietype kunn instellen
Stel een categorietype in voor twee kolommen (ik hoop dat je ziet welke)

In [9]:
users['gender'] = users['gender'].astype('category')
users.occupation = users.occupation.astype('category')
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    category
 2   occupation  943 non-null    category
 3   zip_code    943 non-null    object
dtypes: category(2), int64(1), object(1)
memory usage: 24.8+ KB

## Gemiddelde leeftijd per occupation
Wat is de gemiddelde leeftijd voor elke occupation (zorg ervoor dat je geen FutureWarning krijgt)

In [10]:
users.groupby('occupation', observed=False).mean('age')

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

## Onehot encoding
Maak bijkomende kolommen 'man' en 'vrouw'. De kolom 'man' moet een 1 bevatten voor gender='M' en een 0 voor gender='F'. En de kolom 'vrouw' moet een 0 bevatten voor gender='M' en een 1 voor gender='F'

In [15]:

users['man'] = 0
users.loc[users.gender == 'M', 'man'] = 1
users['vrouw'] = 0
users.loc[users.gender == 'M', 'vrouw'] = 1
users

         age gender     occupation zip_code  man  vrouw
user_id
1         24      M     technician    85711    1      1
2         53      F          other    94043    0      0
3         23      M         writer    32067    1      1
4         24      M     technician    43537    1      1
5         33      F          other    15213    0      0
...      ...    ...            ...      ...  ...    ...
939       26      F        student    33319    0      0
940       32      M  administrator    02215    1      1
941       20      M        student    97229    1      1
942       48      F      librarian    78209    0      0
943       22      M        student    77841    1      1

[943 rows x 6 columns]

## Percentage mannen voor elk beroep
Toon het percentage mannen voor elk beroep, sorteer van groot naar klein

In [27]:
(users.groupby('occupation', observed=False).man.sum() / users.groupby('occupation', observed=False).man.count()).sort_values(ascending=False) * 100

occupation
doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
Name: man, dtype: float64

## oudste en jongste
Toon de hoogste en de laagste leeftijd per occupation

In [28]:
users.groupby('occupation', observed=False).age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

## Toon per occupation en geslacht de gemiddelde leeftijd

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

## Maak een pivottable
Toon per occupation en gender de gemiddelde leeftijd

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154